src/Emacs/emacs_golf.org
#+STARTUP: indent align hidestars
#+TITLE: Emacs Golf
#+DESCRIPTION: My take on Emacs Golf
#+HTML_HEAD: <meta property="og:title" content="Emacs Golf" />
#+HTML_HEAD: <meta property="og:description" content="My take on Emacs Golf." />
#+HTML_HEAD: <meta property="og:type" content="website" />
#+MACRO: a @@html:<a href='$2' rel='external nofollow'>$1</a>@@

* :unicorn: :golf: Emacs Golf 
** Challege {{{a(Rural Posts,http://www.vimgolf.com/challenges/5f1e0217becb80000692b9c4#5f1e3af9becb80000c92ba0c)}}}
*** Solution
#+BEGIN_EXAMPLE
;; Keyboard Macro Editor.  Press C-c C-c to finish; press C-x k RET to cancel.
;; Original keys: C-e M-b S-C-a C-w C-n

Command: last-kbd-macro
Key: none

Macro:

C-e			;; move-end-of-line
M-b			;; backward-word
S-C-a
C-w			;; kill-region
C-n			;; next-line
#+END_EXAMPLE

*** Start File

#+BEGIN_EXAMPLE
RD 5 Gore 9775
RD 6 Gore 9776
RD 7 Gore 9777
RD 1 Great Barrier Island 0991
RD 1 Greta Valley 7387
RD 1 Greytown 5794
RD 1 Hamilton 3281
RD 2 Hamilton 3282
#+END_EXAMPLE

*** End File

#+BEGIN_EXAMPLE
9775
9776
9777
0991
7387
5794
3281
3282
#+END_EXAMPLE

** Challenge 

*** Solution
Run the macro 6 times since there are six non blank lines after the
first one.

#+BEGIN_EXAMPLE
;; Keyboard Macro Editor.  Press C-c C-c to finish; press C-x k RET to cancel.
;; Original keys: C-a * C-e M-f

Command: last-kbd-macro
Key: none

Macro:

C-a			;; move-beginning-of-line
*	  		        ;; self-insert-command
C-e			;; move-end-of-line
M-f			;; forward-word
#+END_EXAMPLE

*** Start File

#+BEGIN_EXAMPLE
This is a
very short

file, but it is 
still
full

of

surpises.
#+END_EXAMPLE


*** End File

#+BEGIN_EXAMPLE
*This is a
*very short

*file, but it is 
*still
*full

*of

*surpises.
#+END_EXAMPLE

