public_html/Emacs/emacs_golf.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-09-04 Fri 00:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs Golf</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Leandro Bravo">
<meta name="description" content="My take on Emacs Golf"
>
<meta property="og:title" content="Emacs Golf" />
<meta property="og:description" content="My take on Emacs Golf." />
<meta property="og:type" content="website" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Emacs Golf</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc545f79">1. :unicorn: :golf: Emacs Golf</a>
<ul>
<li><a href="#org1be2099">1.1. Challege <a href='http://www.vimgolf.com/challenges/5f1e0217becb80000692b9c4#5f1e3af9becb80000c92ba0c' rel='external nofollow'>Rural Posts</a></a>
<ul>
<li><a href="#orge994b6a">1.1.1. Solution</a></li>
<li><a href="#org8fa1f4f">1.1.2. Start File</a></li>
<li><a href="#orgb664900">1.1.3. End File</a></li>
</ul>
</li>
<li><a href="#org2ec385f">1.2. Challenge</a>
<ul>
<li><a href="#org888faa2">1.2.1. Solution</a></li>
<li><a href="#orgd2516b9">1.2.2. Start File</a></li>
<li><a href="#org5d5df10">1.2.3. End File</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgc545f79" class="outline-2">
<h2 id="orgc545f79"><span class="section-number-2">1</span> :unicorn: :golf: Emacs Golf</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1be2099" class="outline-3">
<h3 id="org1be2099"><span class="section-number-3">1.1</span> Challege <a href='http://www.vimgolf.com/challenges/5f1e0217becb80000692b9c4#5f1e3af9becb80000c92ba0c' rel='external nofollow'>Rural Posts</a></h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge994b6a" class="outline-4">
<h4 id="orge994b6a"><span class="section-number-4">1.1.1</span> Solution</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
;; Keyboard Macro Editor.  Press C-c C-c to finish; press C-x k RET to cancel.
;; Original keys: C-e M-b S-C-a C-w C-n

Command: last-kbd-macro
Key: none

Macro:

C-e			;; move-end-of-line
M-b			;; backward-word
S-C-a
C-w			;; kill-region
C-n			;; next-line
</pre>
</div>
</div>

<div id="outline-container-org8fa1f4f" class="outline-4">
<h4 id="org8fa1f4f"><span class="section-number-4">1.1.2</span> Start File</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
RD 5 Gore 9775
RD 6 Gore 9776
RD 7 Gore 9777
RD 1 Great Barrier Island 0991
RD 1 Greta Valley 7387
RD 1 Greytown 5794
RD 1 Hamilton 3281
RD 2 Hamilton 3282
</pre>
</div>
</div>

<div id="outline-container-orgb664900" class="outline-4">
<h4 id="orgb664900"><span class="section-number-4">1.1.3</span> End File</h4>
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
9775
9776
9777
0991
7387
5794
3281
3282
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ec385f" class="outline-3">
<h3 id="org2ec385f"><span class="section-number-3">1.2</span> Challenge</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org888faa2" class="outline-4">
<h4 id="org888faa2"><span class="section-number-4">1.2.1</span> Solution</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Run the macro 6 times since there are six non blank lines after the
first one.
</p>

<pre class="example">
;; Keyboard Macro Editor.  Press C-c C-c to finish; press C-x k RET to cancel.
;; Original keys: C-a * C-e M-f

Command: last-kbd-macro
Key: none

Macro:

C-a			;; move-beginning-of-line
*	  		        ;; self-insert-command
C-e			;; move-end-of-line
M-f			;; forward-word
</pre>
</div>
</div>

<div id="outline-container-orgd2516b9" class="outline-4">
<h4 id="orgd2516b9"><span class="section-number-4">1.2.2</span> Start File</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
This is a
very short

file, but it is 
still
full

of

surpises.
</pre>
</div>
</div>


<div id="outline-container-org5d5df10" class="outline-4">
<h4 id="org5d5df10"><span class="section-number-4">1.2.3</span> End File</h4>
<div class="outline-text-4" id="text-1-2-3">
<pre class="example">
*This is a
*very short

*file, but it is 
*still
*full

*of

*surpises.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Leandro Bravo</p>
<p class="date">Created: 2020-09-04 Fri 00:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
